class Product < ApplicationRecord

attachment :ad_image

belongs_to :user


validates_presence_of :category, :company_name, :ad_name,
 					:ad_show, :ad_show_text, :url, :key_word



CATEGORY_LIST = {
    "SE" => "SE",
    "塾／学校" => "塾／学校",
    "仕事探し" => "仕事探し",
    "ショッピングサイト" => "ショッピングサイト",
    "ファッション" => "ファッション",
    "美容" => "美容",
    "マッサージ" => "マッサージ",
    "旅行" => "旅行",
    "レストラン／カフェ" => "レストラン／カフェ",
    "お部屋探し" => "お部屋探し",
    "健康" => "健康",
    "医療" => "医療",
    "ゲーム／アニメ" => "ゲーム／アニメ",
    "ウェディング" => "ウェディング",
    "株／為替／金融" => "株／為替／金融",
    "" => "",
    "" => "",
    "" => "",
    "" => "",
    "" => ""
  }

CATEGORY_LIST_2 = {
	"SE" => "SE",
    "塾／学校" => "塾／学校",
    "仕事探し" => "仕事探し",
    "ショッピングサイト" => "ショッピングサイト",
    "ファッション" => "ファッション",
    "美容" => "美容",
    "マッサージ" => "マッサージ",
    "旅行" => "旅行",
    "レストラン／カフェ" => "レストラン／カフェ",
    "お部屋探し" => "お部屋探し",
    "健康" => "健康",
    "医療" => "医療",
    "ゲーム／アニメ" => "ゲーム／アニメ",
    "ウェディング" => "ウェディング",
    "株／為替／金融" => "株／為替／金融",
    "" => "",
    "" => "",
    "" => "",
    "" => "",
    "" => ""
}





end
