class Product < ApplicationRecord

attachment :ad_image

belongs_to :user

# attr_accessible :category_ent,
#                 :category,
#                 :category_detail,
#                 :category_2,
#                 :category_detail_2,
#                 :company_name,
#                 :ad_name,
#                 :ad_show,
#                 :key_word



validates_presence_of :category, :company_name, :ad_name,
 					:ad_show, :ad_show_text, :url, :key_word



CATEGORY_LIST = {
    "SE" => "SE",
    "塾／学校" => "塾／学校",
    "仕事探し" => "仕事探し",
    "ショッピングサイト" => "ショッピングサイト",
    "ファッション" => "ファッション",
    "美容" => "美容",
    "マッサージ" => "マッサージ",
    "旅行" => "旅行",
    "レストラン／カフェ" => "レストラン／カフェ",
    "お部屋探し" => "お部屋探し",
    "健康" => "健康",
    "医療" => "医療",
    "ゲーム／アニメ" => "ゲーム／アニメ",
    "ウェディング" => "ウェディング",
    "株／為替／金融" => "株／為替／金融",
    "その他" => "その他",
    "" => "",
    "" => "",
    "" => "",
    "" => ""
  }

CATEGORY_LIST_2 = {
	"SE" => "SE",
    "塾／学校(塾)" => "＜塾＞",
    "塾／学校(専門学校)" => "＜専門学校＞",
    "塾／学校(習い事)" => "＜習い事＞",
    "仕事探し(転職)" => "＜転職＞",
    "仕事探し(新卒)" => "＜新卒＞",
    "仕事探し(アルバイト／パート)" => "＜アルバイト／パート＞",
    "ショッピングサイト(ネットショッピング)" => "＜ネットショッピング＞",
    "ショッピングサイト(リサイクル)" => "＜リサイクル＞",
    "ショッピングサイト(雑誌)" => "＜雑誌＞",
    "ファッション(メイク)" => "＜メイク＞",
    "ファッション(美容院)" => "＜美容院＞",
    "ファッション(衣類／装飾)" => "＜衣類／靴／アクセサリー＞",
    "美容(化粧品)" => "＜化粧品＞",
    "美容(ヘアー)" => "＜ヘアー＞",
    "マッサージ(アロマオイル)" => "＜アロマオイル＞",
    "マッサージ(ツボ押し／鍼灸)" => "＜ツボ押し／鍼灸＞",
    "マッサージ(整体)" => "＜整体＞",
    "旅行(国内旅行)" => "＜国内旅行＞",
    "旅行(国外旅行)" => "＜国外旅行＞",
    "旅行(日帰り)" => "＜日帰り＞",
    "レストラン／カフェ(レストラン)" => "＜レストラン＞",
    "レストラン／カフェ(カフェ)" => "＜カフェ＞",
    "レストラン／カフェ(スイーツ)" => "＜スィーツ＞",
    "お部屋探し(都内)" => "＜都内＞",
    "お部屋探し(関東県外)" => "＜関東県外＞",
    "お部屋探し(不動産)" => "＜不動産＞",
    "健康(薬膳)" => "＜薬膳＞",
    "健康(サプリ)" => "＜サプリ＞",
    "健康(ヨガ／ジム)" => "＜ヨガ／ジム＞",
    "健康(スイミング)" => "＜スイミング＞",
    "健康(スポーツ)" => "＜スポーツ＞",
    "医療(介護)" => "＜介護＞",
    "医療(外科)" => "＜外科＞",
    "医療(内科)" => "＜内科＞",
    "医療(歯科／眼科)" => "＜歯科／眼科＞",
    "医療(健康診断)" => "＜健康診断＞",
    "医療(その他)" => "＜その他医療関係＞",
    "ゲーム／アニメ(ゲーム)" => "＜ゲーム＞",
    "ゲーム／アニメ(アニメ)" => "＜アニメ＞",
    "ゲーム／アニメ(コミックス)" => "＜コミックス＞",
    "ウェディング(ドレス)" => "＜ドレス＞",
    "ウェディング(式場)" => "＜式場＞",
    "ウェディング(ブーケ／ティアラ)" => "＜ブーケ／ティアラ＞",
    "株／為替／金融(株)" => "＜株＞",
    "株／為替／金融(為替)" => "＜為替＞",
    "株／為替／金融(金融)" => "＜金融＞",
    "()" => "＜＞",
    "()" => "＜＞",
    "()" => "＜＞",
    "()" => "＜＞",
    "()" => "＜＞",
    "()" => "＜＞",
    "()" => "＜＞",
    "()" => "＜＞"
}





end
